Revit 2026 API

# CableTraySizesGetEnumerator Method

---

Returns an enumerator that iterates through a collection.

**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public virtual IEnumerator<MEPSize> GetEnumerator()
```
```vb
Public Overridable Function GetEnumerator As IEnumerator(Of MEPSize)
```
```cpp
public:
virtual IEnumerator<MEPSize^>^ GetEnumerator()
```
```fsharp
abstract GetEnumerator : unit -> IEnumerator<MEPSize>
override GetEnumerator : unit -> IEnumerator<MEPSize>
```

#### Return Value

IEnumeratorMEPSizeAn IEnumerator object that can be used to iterate through the collection.

#### Implements

IEnumerableTGetEnumerator

#### Reference

CableTraySizes Class

Autodesk.Revit.DB.Electrical Namespace